app/controllers/api/listings_controller.rb

  def index
    @listings = Listing.all
---
SELECT "listings".* FROM "listings" WHERE (lat < '40.79901460268226') AND (lat > '40.70824841921406') AND (lng > '-74.01696107814979') AND (lng < '-73.9444529218502')