app/views/api/listings/index.json.jbuilder

    json.partial! 'listing', listing: listing
    json.pictures listing.pictures.map { |pic| pic.url }
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."listing_id" = $1  [["listing_id", 40]]